In [1]:
import pandas as pd

In [2]:
import sqlite3

<h2><center>Соединение с БД</center></h2>

In [3]:
connection = sqlite3.connect('../data/checking-logs.sqlite')

<h2><center>Запросы к БД</center></h2>

In [4]:
pd.io.sql.read_sql('pragma table_info(test);', connection)

   cid             name       type  notnull dflt_value  pk
0    0              uid       TEXT        0       None   0
1    1          labname       TEXT        0       None   0
2    2  first_commit_ts  TIMESTAMP        0       None   0
3    3    first_view_ts  TIMESTAMP        0       None   0

In [5]:
pd.io.sql.read_sql("select * from test limit 1, 10", connection)

       uid   labname             first_commit_ts               first_view_ts
0  user_30    laba04  2020-04-18 13:36:53.971502  2020-04-17 22:46:26.785035
1  user_30   laba04s  2020-04-18 14:51:37.498399  2020-04-17 22:46:26.785035
2  user_14    laba04  2020-04-18 15:14:00.312338  2020-04-18 10:53:52.623447
3  user_14   laba04s  2020-04-18 22:30:30.247628  2020-04-18 10:53:52.623447
4  user_19    laba04  2020-04-20 19:05:01.297780  2020-04-21 20:30:38.034966
5  user_25    laba04  2020-04-20 19:16:50.673054  2020-05-09 23:54:54.260791
6  user_21    laba04  2020-04-21 17:48:00.487806  2020-04-22 22:40:36.824081
7  user_30  project1  2020-04-22 12:36:24.053518  2020-04-17 22:46:26.785035
8  user_21   laba04s  2020-04-22 20:09:21.857747  2020-04-22 22:40:36.824081
9  user_28    laba04  2020-04-22 21:47:19.707242  2020-05-10 21:07:50.350946

In [6]:
pd.io.sql.read_sql("select * from deadlines limit 1, 10", connection)

   index      labs   deadlines
0      1   laba04s  1587945599
1      2    laba05  1588550399
2      4    laba06  1590364799
3      5   laba06s  1590364799
4      3  project1  1589673599

In [7]:
df_min = pd.io.sql.read_sql("select test.uid, min((deadlines.deadlines - strftime('%s', test.first_commit_ts)) / 3600) \
                            as delta from test left join deadlines on test.labname = deadlines.labs \
                            where test.labname not like '%project1%' order by delta asc", connection)

In [8]:
df_min

       uid  delta
0  user_25      2

In [9]:
df_max = pd.io.sql.read_sql("select test.uid, max((deadlines.deadlines - strftime('%s', test.first_commit_ts)) / 3600) \
                            as delta from test left join deadlines on test.labname = deadlines.labs \
                            where test.labname not like '%project1%' order by delta asc", connection)

In [10]:
df_max

       uid  delta
0  user_30    202

In [11]:
df_avg = pd.io.sql.read_sql("select avg((deadlines.deadlines - strftime('%s', test.first_commit_ts)) / 3600) \
                            as delta from test left join deadlines on test.labname = deadlines.labs \
                            where test.labname not like '%project1%' order by delta asc", connection)

In [12]:
df_avg

    delta
0  89.125

<h2><center>ТЕСТИРОВАНИЕ ГИПОТЕЗЫ</center></h2>

In [13]:
views_dif = pd.io.sql.read_sql("select dif.uid, avg_diff, pageviews from (select uid, \
                                avg((deadlines.deadlines - strftime('%s', test.first_commit_ts)) / 3600) as avg_diff \
                                from test left join deadlines on test.labname = deadlines.labs where test.labname not like '%project1%' \
                                group by uid) as dif left join (select uid, count(*) as pageviews from pageviews \
                                group by uid) as views on dif.uid = views.uid", connection)

In [14]:
views_dif

        uid    avg_diff  pageviews
0    user_1   64.400000         28
1   user_10   74.800000         89
2   user_14  159.000000        143
3   user_17   61.600000         47
4   user_18    5.666667          3
5   user_19   98.750000         16
6   user_21   95.500000         10
7   user_25   92.600000        179
8   user_28   86.400000        149
9    user_3  105.400000        317
10  user_30  145.250000          3

In [15]:
views_dif.corr()

           avg_diff  pageviews
avg_diff   1.000000   0.279736
pageviews  0.279736   1.000000

<h2><center>Закрытие соединения с БД</center></h2>

In [16]:
connection.close()